In [1]:
import numpy as np

In [2]:
import pandas as pd

In [96]:
emp = {'name':['Nancy','Andrew','Janet','Margaret','Steven'],
         'monthly_salary':[5000,4000,6000,3000,2000],
         'zip':['98122','98401','98033','98052','98051']}

In [98]:
emp_df = pd.DataFrame(emp)
emp_df

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [99]:
emp_df.iloc[0,:]

name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

In [100]:
emp_df.iloc[4,:]

name              Steven
monthly_salary      2000
zip                98051
Name: 4, dtype: object

In [101]:
emp_df.shape

(5, 3)

In [102]:
emp_df.size

15

In [103]:
print(emp_df['monthly_salary'].mean())

4000.0

In [104]:
emp_df.sort_values(by=['name'],ascending=True)

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

In [105]:
emp_df[emp_df['zip']=='98033']

    name  monthly_salary    zip
2  Janet            6000  98033

In [106]:
emp_df['annual_salary'] = emp_df['monthly_salary']*12
emp_df

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [107]:
emp_df = emp_df.rename(columns={'name':'firstname'})
emp_df

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [108]:
emp_info = pd.DataFrame([emp_df.firstname,emp_df.annual_salary,emp_df.zip]).transpose()
emp_info

  firstname annual_salary    zip
0     Nancy         60000  98122
1    Andrew         48000  98401
2     Janet         72000  98033
3  Margaret         36000  98052
4    Steven         24000  98051

In [109]:
print(emp_info.firstname)

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [110]:
emp_info = emp_info.drop('annual_salary', axis=1)
emp_info

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051